import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
      

      <div class ="division">
        <h3>해커톤, 팀</h3>
        <p>
         개인적으로 개발 공부를 하던 중에, 정해진 시간에 팀원들과 밤을 새우며 개발하는 경험을 해보고 싶어 해커톤에 참여했었습니다. 백엔드에 관심이 있던 저는 프론트 앤드 개발자, 기획자를 모아서 팀을 만들었고, 해커톤에서 저희 팀은 교내 물품 대여 중개 서비스를 개발하였었습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>부담과 오만함</h3>
        <p>
        사실 평소 혼자서 개발을 하다 보니 팀 개발에 대한 신뢰가 부족했었습니다. 팀원들이 맡은 바를 잘 수행해 줄 것이라 믿는 반면, 과연 총 5 명의 인원이 한 마음으로 개발하여 결과물을 완성을 해낼까 하는 불안 감이 있었습니다. 팀원 모두 첫 해커톤이었는데 이 소중한 경험을 미완성했던 경험으로 남게 하고 싶지 않았습니다. 때문에 저는 백엔드 파트임에도 불구하고, 프론트 엔드 책을 구매해 얕게나마 공부를 했었습니다. 하지만 그것은 저의 오만한 생각이었습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>같이 고민</h3>
        <p>
          
개발 중 디자인 파트에서 진행한 피그마 프로젝트가 프론트 엔드와 연동이 쉽지 않은 문제가 있었습니다. 관련 파트가 아닌 팀원들 모두 그 문제를 해결하기 위해 탐색했고, 결국은 피그마를 사용하지 말자는 결론을 내렸습니다. 만약 이 문제를 디자인 팀만 고민을 했다면, 시행착오에는 더욱 긴 시간이 걸렸을 것이고, 이 점은 프로젝트 완성에 영향을 줬을 것입니다. 여러 팀원들이 같은 문제를 고민하는 일은 그 고민을 빠르게 해결하는 일이었습니다. 또 개발 후반에 프론트 개발자분이 밤샘 개발로 인해 지쳤고, 때문에 백엔드 API 연결 작업을 힘들어하였습니다. 이때 프론트 엔드 책을 공부했던 경험이 덕분에 프론트의 마무리 작업을 도울 수 있었습니다. 팀은 서로서로의 부족함을 퍼즐처럼 채웠고, 멀리서 보았을 때 하나의 완전한 그림으로 보이게 해주었습니다. 팀에 도움이 될 수 있다는 사실은 큰 기쁨이었고, 그 점이 UMC 에 합류하여 여러 사람들과 함께하고 싶은 이유입니다.
        </p>
      </div>

      <div class ="division">
        <h3>같이 개발</h3>
        <p>
        해커톤을 통해 얻은 것은 개발 능력이 아닌 팀의 힘을 느낀 것이었습니다. 기획 단계에서 팀원 들은 여러 아이디어를 공유했고 그것들은 생각지도 못한 면을 볼 수 있게 해주었으며, 대화를 거듭할수록 아이디어는 꼬리를 물고 발전해 나갔습니다. 또한 프론트 엔드 개발자의 의견이 필요한 부분에서는 곧바로 답변을 해주시면서 쉽게 기획의 빈틈을 줄여 나갔습니다. 이후 저는 REST API 개발을, 프론트 개발자분들은 페이지 개발을 시작하였습니다. 노션을 통해 프론트와 정보를 공유하며 진행을 했는데, 그 과정에서 프로젝트의 Work Flow 는 직렬이 아닌 병렬로 진행됨을 느낄 수 있었습니다. 때문에 작업 속도는 빨랐고, 같이 하는 것이 정말 재미있었습니다. 또 무섭고 거대했던 프로젝트는 저에게 작은 덩어리로 쪼개져 오게 되는 것을 보고 같이 개발이 가진 힘을 느낄 수 있었습니다.
        </p>  
      </div>
      <div class ="division">
        <h3>저는 팀 활동을 하고 싶습니다. 함께하고 싶은 개발자가 되고 싶습니다.</h3>
        
      </div>
    </div>
  );
};

export default SelfIntro;